w8d1/RedditClone/app/controllers/comments_controller.rb

    def create
        @comment = Comment.new(comment_params)
        @comment.author_id = current_user.id

        # debugger

        if @comment.save
---
INSERT INTO "comments" ("content", "author_id", "post_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["content", "GO?"], ["author_id", 3], ["post_id", 1], ["created_at", "2020-08-24 21:31:45.152566"], ["updated_at", "2020-08-24 21:31:45.152566"]]