w8d1/RedditClone/app/views/posts/show.html.erb

SELECT "subs".* FROM "subs" INNER JOIN "postsubs" ON "subs"."id" = "postsubs"."sub_id" WHERE "postsubs"."post_id" = $1  [["post_id", 1]]
---
<ul>
<% @post.subs.each do |sub| %>

SELECT  1 AS one FROM "comments" WHERE "comments"."post_id" = $1 LIMIT $2  [["post_id", 1], ["LIMIT", 1]]
---

<% unless @post.comments.empty? %>