w7d2/music_app/app/models/user.rb

UPDATE "users" SET "session_token" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["session_token", "1hF2VYKsl8Lrmov-q52yVA"], ["updated_at", "2020-08-18 19:34:20.749088"], ["id", 1]]
---
    def reset_session_token!
        self.session_token = User.generate_session_token
        # self.session_token = setter method => can be saved
        # NOT @session_token
        self.save!